content/mock-soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://jboss.org/fis/mock-soap-service">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getCountryRequest>
         <gs:name>China</gs:name>
      </gs:getCountryRequest>
   </soapenv:Body>
</soapenv:Envelope>
